app/views/users/likes.html.erb

    <% @likes.each do |like|%>
      <% post = Post.find_by(id: like.post_id) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."post_id" = ? LIMIT ?  [["post_id", 1], ["LIMIT", 1]]