app/controllers/users_controller.rb

  def create
    @user = User.new(
      name: params[:name] ,
      email: params[:email] ,
      image_name:"default_user.jpg"
    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?, ?)  [["name", "pug"], ["email", "pug@inu.com"], ["created_at", "2022-07-03 00:06:08.971722"], ["updated_at", "2022-07-03 00:06:08.971722"], ["image_name", "default_user.png"]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}" , image.read)
    end

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "image_name" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-03 00:51:47.340970"], ["image_name", "4.jpg"], ["id", 4]]